
__all__ = ['CORE_VOCAB']

CORE_VOCAB = {
    'ὁ': {
        'gloss': 'the',
        'forms': [
            'ὁ', 'τοῦ', 'τῷ', 'τόν', 'τὸν',
            'ἡ', 'τῆς', 'τῇ', 'τήν', 'τὴν',
            'τό', 'τὸ',
            'οἱ', 'τῶν', 'τοῖς', 'τούς', 'τοὺς',
            'αἱ', 'ταῖς', 'τάς', 'τὰς',
            'τά', 'τὰ'
        ]
    },
    'καί': {
        'gloss': 'and, also, even',
        'forms': [
            'καί', 'καὶ'
        ]
    },
    'αὐτός': {
        'gloss': 'he, she, it',
        'forms': [
            'αὐτὸς', 'αὐτοῦ', 'αὐτῷ', 'αὐτόν', 'αὐτὸν',
            'αὐτή', 'αὐτὴ', 'αὐτῆς', 'αὐτῇ', 'αὐτήν', 'αὐτὴν',
            'αὐτό', 'αὐτὸ',
            'αὐτοί', 'αὐτοὶ', 'αὐτῶν', 'αὐτοῖς', 'αὐτούς', 'αὐτοὺς',
            'αὐταί', 'αὐταὶ', 'αὐταῖς', 'αὐτάς', 'αὐτὰς',
            'αὐτά', 'αὐτὰ'
        ]
    },
    'σύ': {
        'gloss': 'you',
        'forms': [
            'σοῦ', 'σοί', 'σοὶ', 'σέ', 'σὲ',
            'σου', 'σοι', 'σε'
        ]
    },
    'ὑμεῖς': {
        'gloss': 'you (pl)',
        'forms': [
            'ὑμῶν', 'ὑμῖν', 'ὑμᾶς'
        ]
    },
    'ἐν': {
        'gloss': 'in'
    },
    'ἐγώ': {
        'gloss': 'I',
        'forms': [
            'ἐγὼ', 'μοῦ', 'μοί', 'μοὶ', 'μέ', 'μὲ',
            'μου', 'μοι', 'με'
        ]
    },
    'ἡμεῖς': {
        'gloss': 'we',
        'forms': [
            'ἡμῶν', 'ἡμῖν', 'ἡμᾶς'
        ]
    },
    'δέ': {
        'gloss': 'and, but',
        'forms': [
            'δὲ'
        ]
    },
    'εἰς': {
        'gloss': 'into'
    },
    'οὐ': {
        'gloss': 'no, not',
        'forms': [
            'οὐκ', 'οὐχ', 'οὐχί'
        ]
    }
}
